---
title: PipeScheduleType
classe: Autodesk.Revit.DB.Plumbing.PipeScheduleType
namespace: Autodesk.Revit.DB.Plumbing
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# PipeScheduleType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `PipeScheduleType Create(Document, String)` | `PipeScheduleType.Create(doc, name)` | PipeScheduleType |
| `ElementId GetPipeScheduleId(Document, String)` | `PipeScheduleType.GetPipeScheduleId(doc, name)` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```